
List<Map<String,String>> part1 = [

  {
    "id":"1",
    "title" : "الجزء الأول",
    "thetext": ''' 
   انا فرح اسمى فرح بس ده مش اسمى الحقيقى اسمى الحقيقى
هنا بس كل الناس بتقولى فرح
صحابى اهلى اخواتى كل الناس
عندى 25 سنه ابويا صعيدى وامى تركيه مصريه ابوها مصرى وامها تركيه طبعا
واخده شكلها هى كانت زى القمر
هتسالونى ليه كانت هقولكم انى عمرى ما شوفت امى اصلا اصلها ماتت وهى
بتولدنى يعنى انا اتولدت يتيمه كل اللى اعرفه عنها من حكايات بابا وخالى وجدو
حسين وده هو ابوها بحبه اوى بس هو كمان مات
بابا حبيبى مقدرش اعيش من غيره بيحبنى انا واخواتى اوى اوى عمره فى يوم
ما حسسنى انى اقل من اى حد طول عمره الاب والام والام قبل الاب
عمرى ماحسيت بحاجه نقصانى كان نفسى اوى اعوضه عن السنين اللى عاشها
وهو بيربينا واعوضه عن العيله اللى اتخلت عنه لما قرر انه يتجوز امى
اصلا هو اتجوزها فى امريكا كان مسافر يدرس هناك وهى كمان كانت عايشه
هناك هى وجدو وتيته وخالو حبوا بعض واتجوزوا طبعا العيله غضبت عليه بس هو
قال انه مش ممكن يسيبها فكان رد فعل العيله انها قالتله احنا اعتبرناك مت
ههههه شوفته فى حد كده بس هم دماغهم كده هنعمل ايه
المهم بابا وماما اتجوزوا وهى كانت بتدرس وبابا كان بيعمل الماجستير وكان
بيشتغل علشان يصرف على ماما وخصوصا انها بقت حامل
امى احسن ام فى الدنيا وقفت جمب بابا فى محنته وقفت جمبه لما الكل اتخلى عنه
ماما جابت للدنيا احلى اخين فى العالم كله هم حياتى كلها مش قادره اتخيل
حياتى من غيرهم عامله ازاى
تؤام نفس الشكل بس اختلاف السما من الارض فى الشكل واحد هادى وعاقل
كده بس التانى ايه مطرقع حاجه كده هم الاتنين مفيش منها
اسر وجاسر
اسر الكبير العاقل اكبر من جاسر ب5 دقايق بحالهم بحبه اوى هو بيشتغل دكتور قلب
اما جاسر فهو الصغير روش ومطرقع بس برضه عاقل وناجح فى حياته جدا هو برده
دكتور بس هو دكتور اسنان
على فكره هم طالعين لبابا هو برده دكتور جراح
انا بقى اخر العنقود
بابا دايما يقولى احنا بنقولك فرح لانه الفرحه الى دخلت بيتنا بعد سدره امى كان اسمها سدره اسم غريب بس حلو
امى ماتت وسابتنى لابويا من كتر حبه فيها مرضاش يتجز بعدها خالى فؤاد كان
عنده ابن اكبر منى باسبوع فمراته رضعتنى معاه فبقى هو اخويا فى الرضاعه
بقت فرح اخت عمر
بابا حبيبى بعد اما خلص الدكتوراه اكبر مستشفى فى نيويوك طلبت منه يشتغل
فيها و كان شاطر اوى فى شغله
كان لازم انا واخواتى نعوضه عن تعبه معانا وده كان اننا نذاكر كويس ونتفوق فى دراستنا
انا واخواتى عمرنا ما افترقنا كنت علطول معاهم فى اى حاجه حتى لما روحت
المدرسه كنت عاوزه ابقى معاهم حاولو يقنعونى انه مينفعش عشان هم اكبر
منى ب5 سنين بس بتقول لمين
بابا قالى انى ممكن ابقى معاهم بس لو زاكرت كل سنه منهج السنتين
فضلت كده فعلا اذاكر كل سنه سنتين مع بعض كنت ببقى مبسوطه اوى علشان
هكبر وابقى مع اخواتى انا من يومى زكيه فكان ده سهل بالنسبالى خصوصا انا
كنت بعمل حاجه بحبها
تعرفوا انا دخلت الجامعه عندى13 سنه ده طبعا كان حاجه غير عاديه بس انا
افترقت ان اخواتى هم درسوا طب وانا درست ادب
بس بابا كان فخور بيا اوى طول عمرى سابقه سنى كنت بدور على الحاجه اللى
بتبسطه واعملها لقيته بيتبسط انى ببقىى شاطره فى الدراسه
كنت بذاكر زياده علشان يبقى مبسوط منى
بابا كان على طول بيفسحنى ويخرجنى ويجبلى كل اللى نفسى فيه قبل حتى ما اطلبه
اتخرجت من الجامعه عندى 16 سنه كان اللى فى سنى لسه فى الثانوى طبعا

ما سكتش على كده بدات احضر الماجستير والدكتوراه بقيت اصغر دكتوره عندى
20 سنه ومعايا الدكتوراه من السربون اكبر جامعهفى باريس منا وقتها جاتلى منحه
احضر الدكتوراه فى السربون سافرت كان عندى 18 سنه اول مره اعيش بعيد عن
بابا واخواتى بس كله فى سبيل انى احقق حلم بابا
قعدت السنتين لوحدى فى مساكن الطلبه
بس بابا كان مطمن عليا اصلى بالرغم انى طول عمرى عايشه فى امريكا الا انى
بفكر تفكير شرقى بحت وكنت لابسه الحجاب من وانا عندى 15 سنه وكنت بلبس
الحجاب الشرعى مش حجاب اليومين دول
بابا كان مربينا على عادات الشرق والعرق الصعيدى فى كل واحد فينا انا واخواتى
تعرفوا لو كان حد من خواتى كان شافنى واقفه مع ولد حتى لو بيسالنى على
حاجه كان بيبقى يوم رهيب ده كانت بتوصل سعات انهم يخاصمونى اكتر حاجه
بتتعبنى انهم يخاصمونى ممكن اعمل اى حاجه الا انهم ميزعلوش منى
المهم خلصت الدكتوراه ورجعت امريكا تانى وبدات ادرس فى جامعه يال درست
سنه بس مكملتش اصل بابا اصر اننا نرجع مصر قال كفايه غربه
الواد عمر غار منى وقال اشمعنى هى حضرت دكتوراه انا كمان لازم احضرها طول
عمره بيعمل كده انا وهو طول عمرنا ناقر ونقير
اه بس بنحب بعض مهو برده اخويا
ورجعنا مصر وبابا واخواتى بدوا يبنوا المستشفى بنوا اكبر مستشفى فى القاهره
مهى بقى تخصص العيله
بابا جه فى يوم قبل افتتاح المستشفى قرر ياخدنا ونسافر الصعيد
قال لازم نشوف العيله ونعرفهم اصلهم دول عيلتنا مينفعش منعرفهمش وسافرنا
طبعا الاستقبال كان غيرمتوقع
كنا متخيلين انهم ممكن يحبونا بس ايه عمامى كانوا فاكرنا جايين علشان الفلوس
بس جدى الوحيد اللى رحب بينا شويه يعنى مش اوى دا حتى
مفكروش يسالوا عن اسامينا
المهم رجعنا بيتنا والمستشفى اشتغلت كويس اوى وانا بقى اتعينت فى جامعه
القاهره دكتوره فى ليه الاداب
طبعا انتم كده عرفتم حكايتى
تعالو بقى نتعرف على العيله
بابا فاروق
راجل طيب بيحبنا جدا زى ما قولتلكم دكتور بس دكتور شاطر اوى
اسر:حبيبى العاقل دكتور قلب جد اوى فى شغله
جاسر:جياسر جسور حبيبى قمر يا خواتى البنات هتموت عليه بس هو ايه ولا
بيفكر فيهم رغم انه واسر نفس الشكل بس مش عارفه البنات دول بيفرقوا بنهم
ازاى يمكن علشان جاسر علطول بيضحك بس
لو فى الشغل حصل غلطه بيبقى نهار اسود
الدور عليا انا اظن انكم زهقتوا منى بس هقولكم على حاجه اخيره قبل ما ابدا

حكايتى انا مشكلتى انى عمرى ما اقدر اقول لبابا لا مقدرش ابدا ممكن اعمل اى
حاجه علشان هو طلبها منى بس يا ترى نتيجه العاده دى ايه اللى هيحصلى وايه
اللى غير حياتى بسببها هقولكم ...........

           ''',

  },

  {
    "id":"2",
    "title" : "المقدمة2",
    "thetext": '''
    
هتلر
    ''',

  }

];


List allStory = [
  'الصفحة رقم 1' ,
  'الصفحة رقم2 ' ,
  'الصفحة رقم 3' ,
  'الصفحة رقم 4' ,
];